{

    "value":{
        "uuid":"395af9f6-c7ae-4bde-be33-7e073eee7ac5",
        "title":"Dream Theater Essentials",
        "numberOfTracks":46,
        "numberOfVideos":0,
        "creator":{
        },
        "description":"Dream Theater is absolutely one of the most genre defining and iconic progressive rock bands over the last thirty years. Responsible for making multiple classics in the the progressive metal genre, they are pioneers for generations of musicians making music, ranging from jazz to metal. The band was formed under the name Majesty in 1985, by John Petrucci, John Myung and Mike Portnoy, while they all attended Berklee College of Music. Dropping out to concentrate on the band, they would later rename themselves Dream Theater (suggested by Portnoy's father, originated from a small theater in Monterey, California). Petrucci then asked high school bandmate Kevin Moore to join the band, along with vocalist Chris Collins, who was later replaced by singer Charlie Dominici. With their new moniker, the band started writing original material while playing concerts in New York. They signed their first record contract with Mechanic on June 23, 1988. Their first album, 'When Dream And Day Unite', was finished in about three weeks, and released in 1989. After vocalist Charlie Dominici's departure from the band, they brought James LaBrie on board. The band signed a seven-album contract with a division of Atlantic records, and their next album, 'Images And Word', was released in 1992. The album has grown over the years to be a iconic progressive metal masterpiece, and is considered to be their best by many fans – a piece of art with a unmatchable creative surplus. Dream Theater continued to release a number of great records after 'Images and Words', including 'Awake', 'A Change Of Seasons' and 'Falling Into Infinity'. Kevin Moore left the band in 1994, right after 'Awake' was recorded, and replaced by Derek Sherinian. In 1997, Portnoy and Petrucci started a progressive supergroup, as an instrumental side project called Liquid Tension Experiment, together with Tony Levin on bass and Jordan Rudess on keys. They asked Rudess (actually for the second time in their career) to join Dream Theater, which he did, replacing Sherinian. With Rudess they recorded four more albums, starting with the legendary concept album 'Scenes From A Memory', followed by 'Six Degrees of Inner Turbulence', 'Train Of Thought' and 'Octavarium' – albums that reflected completely different inspirations. In 2007 they released 'Systematic Chaos', after signing to Roadrunner Records, followed by 'Black Clouds And Silver Linings' two years after. \nA dramatic change in the bands history came when founding member Mike Portnoy left the band in September 2010. He had been a part of the group since the beginning, shaping the band over almost thirty years. With their new drummer Mike Mangini they released 'A Dramatic Turn of Events' in 2011, and the self titled 'Dream Theater' in 2013. In addition to all this, the band has released a number of live-albums and concert films. \nDream Theater's latest addition to an already legendary discography, is 'The Astonishing'. Complete with characters and a storyline taking place in a dystopian future, 'The Astonishing' is the longest album in Dream Theater's career — clocking in at over 2 hours and 10 minutes. The story is the most important element. Written primarily by guitarist John Petrucci, it was inspired by his love for science fiction epics like Game of Thrones, Star Wars and Lord of The Rings, along with his observations of technology's steady replacement of humans in society. 'The Astonishing' is presented in two acts and told through the perspective of eight different characters, representing both the rebel militia, Ravenskill, and the opposing dictatorial empire, The Great Northern Empire of the Americas. John Petrucci and Jordan Rudess wrote most of the music behind a piano, like a detailed soundtrack to a immersive epic narrative. Take a deep dive into this remarkable list, stuffed with some of the most unique and remarkable progressive music ever made. (Photo: Jimmy Fontaine, Roadrunner/press)",
        "duration":24621,
        "lastUpdated":"2019-05-29T13:33:46+01:00",
        "created":"2016-01-27T08:58:41+00:00",
        "type":"EDITORIAL",
        "publicPlaylist":true,
        "url":"http://www.tidal.com/playlist/395af9f6-c7ae-4bde-be33-7e073eee7ac5",
        "image":"b13b8c57-d9c7-46ae-ba78-bdd5365f5981",
        "popularity":11,
        "squareImage":"d67bc48e-3c32-40b5-879e-ebe8cc795bf5"
    },

}